//:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
//Q11 Не смог сделать перегузку функций для приема указателя на <typename any> (например, когда приходит массив) чтобы описать особые условия работы с ними
//template <typename any>
//static bool Collection_test_methods_2(Collection<any[]>& test_obj)
//:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


//:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
//Q10 Не смог заставить коллекцию работать с массивами и прочими объектами типа std::vector - ошибка С3863
//:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


//:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
//Q9 сравнение указателей дает ошибку С2446: почему-то в шаблоне указтель на any не превращается в указатель на конкретный тип данных???

/*template <typename any>
static bool Collection_pointers_test(Collection<any>& test_obj)
{
	bool result = 1;
	std::cout << "\n\nPointers test:" << "\n*test_obj.begin() == test_obj[0]";
	if (test_obj.begin() == &test_obj[0]) std::cout << " true";
	else { std::cout << " false"; result = 0; }

	std::cout << "\n" << "*test_obj.end() == test_obj[test_obj.size()-1])";
	if (test_obj.end() == &test_obj[test_obj.size() - 1]) std::cout << " true";
	else { std::cout << " false"; result = 0; }

	return result;
}*/
//:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
